# 元组：不可以修改的列表
# 元组中嵌套的列表是可以修改的


# 定义元组
# t1 = (1, 2, 3, 4)
# t2 = ()
# t3 = tuple()
#
# print(type(t1))
# print(type(t2))
# print(type(t3))


# 定义单个元素的元组 元素后面必须带逗号，
# t4 = ("123", )
# #
# print(type(t4))


# 元组的嵌套
# t5 = ((1, 2, 3), (4, 5, 6))
# #
# print(type(t5))


# 通过下标取出元素
# t6 = ((1, 2, 3), (4, 5, 6))
# #
# print(t6[1][2])


# 查找元素下标 index
# t7 = (1,2,3,4,5,6)
# #
# print(t7.index(1))


# 统计元素出现次数
# t8 = (1, 2, 3, 4, 5, 6, 5, 4, 3, 2, 1)
# #
# print(t8.count(4))


# 统计元组的元素数量
# t9 = (1, 2, 3, 4, 5, 6, 5, 4, 3, 2, 1)
# #
# print(len(t9))


# while 循环元组
# t10 = (1, 2, 3, 4, 5, 6, 5, 4, 3, 2, 1)
# #
# index = 0
# while index < len(t10):
#     print(t10[index])
#     index += 1


# for 循环元组
# t11 = (1, 2, 3, 4, 5, 6, 5, 4, 3, 2, 1)
# #
# for item in t11:
#     print(item)
